AWS/syscontrol-docs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-05 Tue 13:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title><code>syscontrol.sh</code> Docs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zachary Haskins" />
</head>
<body>
<div id="content">
<h1 class="title"><code>syscontrol.sh</code> Docs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3e5e912">1. TL;DR</a></li>
<li><a href="#orgfdb582a">2. First Time Setup</a></li>
<li><a href="#orga9b8f64">3. Available Options</a>
<ul>
<li><a href="#org9038c1c">3.1. Help</a></li>
<li><a href="#org3ebe96b">3.2. Fresh</a></li>
<li><a href="#orgdbc1cab">3.3. Init</a></li>
<li><a href="#org048c9ec">3.4. Install</a></li>
<li><a href="#org77e4a58">3.5. Configure</a></li>
<li><a href="#org2cc0191">3.6. Serve</a></li>
<li><a href="#org646cf20">3.7. Update</a></li>
<li><a href="#orgf31073b">3.8. Status</a></li>
<li><a href="#org3a22403">3.9. Kill</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3e5e912" class="outline-2">
<h2 id="org3e5e912"><span class="section-number-2">1</span> TL;DR</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Clone the repo</li>
<li><code>cd</code> into <code>./rubricapp/AWS</code></li>
<li><code>./syscontrol.sh --fresh</code></li>
<li><code>cd ~/POGIL_PRODUCTION/rubricapp/AWS</code></li>
<li><code>rm -r</code> the original repo directory</li>
<li><code>./syscontrol.sh --init</code></li>
<li><code>./syscontrol.sh --serve</code></li>
</ol>
</div>
</div>

<div id="outline-container-orgfdb582a" class="outline-2">
<h2 id="orgfdb582a"><span class="section-number-2">2</span> First Time Setup</h2>
<div class="outline-text-2" id="text-2">
<p>
Clone the repo into the AWS instance and <code>cd</code> into it.
</p>

<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/Lunatic-Labs/rubricapp.git/
cd ./rubricapp/AWS/
</pre>
</div>

<p>
Then run <code>syscontrol.sh</code> with the <code>--fresh</code> option
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --fresh
</pre>
</div>

<p>
This will create a production directory at <code>/home/$USER/POGIL_PRODUCTION/</code>.
The next step is to remove the old <code>rubricapp</code> repo that was originally
cloned as it is no longer needed because the entire directory was copied
into this new production directory.
</p>

<p>
Now, <code>cd</code> into it.
</p>

<div class="org-src-container">
<pre class="src src-bash">cd /home/$USER/POGIL_PRODUCTION/rubricapp/AWS/
</pre>
</div>

<p>
Then run the following to set everything up:
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --init
</pre>
</div>

<p>
See <i>section 3.3</i>: <b>Init</b> for more information on this option.
</p>

<p>
Everything should be installed, up-to-date, and configured to run <i>rubricapp</i>. Finally, run the following
to launch <i>rubricapp</i>:
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --serve
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9b8f64" class="outline-2">
<h2 id="orga9b8f64"><span class="section-number-2">3</span> Available Options</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9038c1c" class="outline-3">
<h3 id="org9038c1c"><span class="section-number-3">3.1</span> Help</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<i>Usage</i>:
</p>
<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --help
</pre>
</div>

<p>
<i>Description</i>:
</p>

<p>
Displays all of the different options that can be passed to <code>syscontrol.sh</code>.
</p>

<p>
The order of the options displayed in the help message are in logical order
to cloning the project.
</p>
</div>
</div>

<div id="outline-container-org3ebe96b" class="outline-3">
<h3 id="org3ebe96b"><span class="section-number-3">3.2</span> Fresh</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<i>Usage</i>:
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --fresh
</pre>
</div>

<p>
<i>Description</i>:
</p>

<p>
See <i>section 2</i>: <b>First Time Setup</b>
</p>
</div>
</div>

<div id="outline-container-orgdbc1cab" class="outline-3">
<h3 id="orgdbc1cab"><span class="section-number-3">3.3</span> Init</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<i>Usage</i>:
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --init
</pre>
</div>

<p>
<i>Description</i>:
</p>

<p>
This is intended to be the option you use after running <code>--fresh</code>. It should only be used once. It runs the following:
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --install
./syscontrol.sh --configure
</pre>
</div>

<p>
<b>[WARNING]</b>
</p>

<p>
This option completely wipes the database and sets it up.
</p>
</div>
</div>

<div id="outline-container-org048c9ec" class="outline-3">
<h3 id="org048c9ec"><span class="section-number-3">3.4</span> Install</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<i>Usage</i>:
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --install
</pre>
</div>

<p>
<i>Description</i>:
</p>

<p>
Installs necessary dependencies for <code>apt</code>, <code>pip</code>, and <code>npm</code>.
</p>
</div>
</div>

<div id="outline-container-org77e4a58" class="outline-3">
<h3 id="org77e4a58"><span class="section-number-3">3.5</span> Configure</h3>
<div class="outline-text-3" id="text-3-5">
<p>
<i>Usage</i>:
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --configure
</pre>
</div>

<p>
<i>Description</i>:
</p>

<p>
This option configures the services for <code>gunicorn</code>, <code>nginx</code>, and the firewall through <code>ufw</code>.
</p>

<ul class="org-ul">
<li>The <code>gunicorn</code> service gets instantiated in <code>/etc/systemd/system/rubricapp.service</code>.</li>
<li>The <code>nginx</code> service gets instantiated in <code>/etc/nginx/sites-available/rubricapp</code>.</li>
<li>The ports that get open through <code>ufw</code> are:
<ul class="org-ul">
<li>80</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2cc0191" class="outline-3">
<h3 id="org2cc0191"><span class="section-number-3">3.6</span> Serve</h3>
<div class="outline-text-3" id="text-3-6">
<p>
<i>Usage</i>:
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --serve
</pre>
</div>

<p>
<i>Description</i>:
</p>

<p>
Serves the application. This is the option to use to start all services and make <i>rubricapp</i> live.
</p>
</div>
</div>

<div id="outline-container-org646cf20" class="outline-3">
<h3 id="org646cf20"><span class="section-number-3">3.7</span> Update</h3>
<div class="outline-text-3" id="text-3-7">
<p>
<b>[WARNING]</b>: untested
</p>

<p>
<i>Usage</i>:
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --update
</pre>
</div>

<p>
<i>Description</i>:
</p>

<p>
Checks for updates on the remote repo. If there is,
it shuts down all services currently running, pulls the new changes, and restarts the services.
</p>
</div>
</div>

<div id="outline-container-orgf31073b" class="outline-3">
<h3 id="orgf31073b"><span class="section-number-3">3.8</span> Status</h3>
<div class="outline-text-3" id="text-3-8">
<p>
<i>Usage</i>:
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --update
</pre>
</div>

<p>
<i>Description</i>:
</p>

<p>
Prints the current status of all services required for <i>rubricapp</i>.
</p>
</div>
</div>

<div id="outline-container-org3a22403" class="outline-3">
<h3 id="org3a22403"><span class="section-number-3">3.9</span> Kill</h3>
<div class="outline-text-3" id="text-3-9">
<p>
<i>Usage</i>:
</p>

<div class="org-src-container">
<pre class="src src-bash">./syscontrol.sh --update
</pre>
</div>

<p>
<i>Description</i>:
</p>

<p>
Kills all processes required for running <i>rubricapp</i>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zachary Haskins</p>
<p class="date">Created: 2024-03-05 Tue 13:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
